window.dataLoaded = false;
let title_of_eom = themeOfDEC;
const data = {
    "index_1":{
        "subtitle": "Ознакомьтесь с правилами техники безопасности при ведении технологического процесса на установке депарафинизации.",
        "step_of_popup": "Ознакомьтесь с правилами техники безопасности при ведении технологического процесса на установке депарафинизации.",
        "paragraph_1":[
            {"image": true, "image_path": "./content/first_p_img_6_2.png", "img_sign": "", "left_img": true},
            {"text": `Для исключения травмирования рабочих на установке, необходимо соблюдать <b>правила охраны труда и техники безопасности:</b>
                <p style='magin-left: 0px;'>
                    <ol>
                        <li>Во время работы использовать индивидуальные средства защиты;</li>
                        <li>Особое внимание уделять при работе с движущимися и вращающимися частями аппаратов;</li>
                        <li>Избегать прикасания к нагретым частям аппаратов;</li>
                        <li>Соблюдать правила техники безопасности.</li>
                    </ol>
                </p>
                <p>Для исключения негативного влияния на окружающую среду отслеживать:</p>
                <p>
                    <ol>
                        <li>Сбор промышленных сточных вод в систему утилизации, с предварительной очисткой;</li>
                        <li>Минимизировать и не превышать предельно-допустимых концентраций в атмосфере всех ингредиентов, которые выбрасываются на установке;</li>
                        <li>Первичная переработка и утилизация промышленных отходов.</li>
                    </ol>
                </p>`},
        ],
    },
    "index_2":{
        "subtitle": "Изучите конструкцию и принцип работы скребкового кристаллизатора.",
        "step_of_popup": "Изучите конструкцию и принцип работы скребкового кристаллизатора.",
        "paragraph_1":[
            {"text": `Скребковые кристаллизаторы применяются в процессах депарафинизациии при использовании избирательных растворителей.`},
            {"text": `Скребковые кристаллизаторы являются основным оборудованием установок депарафинизации и необходимы для охлаждения смеси сырья с растворителем с целью кристаллизации парафиновых углеводородов. Конструктивно они представляют собой теплообменники типа «труба в трубе».`},
            {"text": `<b class='blue_header'>Принцип работы кристаллизатора:</b> суспензия сырья проходит по внутренним трубам, охлаждается и образует тонкий слой суспензии, который прилегает к внутренней трубе. Затем этот слой удаляется скребками. Снятый слой перемешивается с теплой суспензией.`},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/second_p_img_6_2.png", "img_sign": "Конструкция скребкового кристаллизатора", "left_img": true},
        ],
        "paragraph_3":[
            {"text": `В таких кристаллизаторах может быть разное количество секций, каждая из них состоит из внутренней и наружной трубы.`},
        ],
    },
    "index_3":{
        "subtitle": "Сопоставьте элемент конструкции скребкового кристаллизатора с его названием.",
        "step_of_popup": "Сопоставьте элемент конструкции скребкового кристаллизатора с его названием.",
        "test": [{
            "type": 5
        }, {
            "leftColumn": 3
        }, {
            "rightColumn": 3
        }, {
            "image": "./content/115114.png"
        }, {
            "answers": ['Наружная труба', 'Суспензия сырья', 'Внутренняя труба', 'Хладагент', 'Слой твердой фазы', 'Скребок']
        }],
    },
    "index_4":{
        "subtitle": "Изучите конструкцию и принцип работы кристаллизатора смешивания.",
        "step_of_popup": "Изучите конструкцию и принцип работы кристаллизатора смешивания.",
        "paragraph_1":[
            {"text": `Работа кристаллизатора смешивания осуществляется по принципу зависимости добавления растворителя порциями, который предварительно будет охлаждаться и далее уже смешиваться с сырьем.`},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/fourth_p_img_6_2.png", "img_sign": "Конструкция кристаллизатора смешивания", "left_img": true},
        ],
        "paragraph_3":[
            {"text": `Сам аппарат разделяется на секции специальными перегородками (4). И, соответственно, в каждую из четырех секций будет подаваться предварительно охлажденный растворитель (II).`},
            {"text": `В нижнюю секцию аппарата будет подаваться сырье (I), а также определенная порция растворителя (II), и за счет перемешивающих устройств (2), которые прикреплены к корпусу (1) аппарата. Суспензия (III) твердых углеводородов выводится сверху кристаллизатора.`},
            {"text": `В таких кристаллизаторах образуются крупные кристаллы, а следственно, увеличивается скорость разделения.`},
        ],
    },
    "index_5": {
        "subtitle": "Определите правильное расположение движения фаз в кристаллизаторе смешивания.",
        "step_of_popup": "Определите правильное расположение движения фаз в кристаллизаторе смешивания.",
        "test": [{
            "type": 2
        }, {
            "description": "Впишите название сырья с соответствующим ему номером:"
        }, {
            "test_with_text_2": "1) {=Сырье,сырье} <br> 2) {=Суспензия,суспензия} <br> 3) {=Растворитель,растворитель} <br> 4) {=Растворитель,растворитель} <br> 5) {=Растворитель,растворитель} <br> 6) {=Растворитель,растворитель} <br> 7) {=Растворитель,растворитель} <br> 8) {=Растворитель,растворитель} <br>"
        }, {
            "image": true,
            "image_path": "./content/fifth_p_img_6_2.png"
        }],
    },
    "index_6": {
        "subtitle": "Изучите конструкцию и принцип работы вакуумных фильтров.",
        "step_of_popup": "Изучите конструкцию и принцип работы вакуумных фильтров.",
        "paragraph_1":[
            {"text": `<b class='blue_header'>Фильтры</b> – это специальные аппараты, которые предназначены для отделения кристаллов твердых углеводородов из раствора депарафинизата.`},
             
            {"text": `В состав фильтра входят следующие элементы: вращающийся барабан, который обтягивается фильтровальной тканью, а так же распределительные устройства.`},
            {"text": `Охлажденный раствор подается в фильтр. Фильтрование раствора происходит из-за создания вакуума в секциях аппарата. Раствор депарафинизата, проходя через фильтровальную ткань, отфильтровывается, и на поверхности ткани остаются кристаллы парафинов. Осадок, который остается после фильтрования на ткани, промывается растворителем.`},
            {"text": `Внутри секций будет постоянно поддерживаться вакуум. Растворитель, проходя через слой твердых углеводородов, будет их промывать и, соответственно, растворять масло. Промытый осадок отдувается с использованием инертного газа.`},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/sixth_p_img_6_2.png", "img_sign": "Элементы конструкции схем с вакуумными фильтрами", "left_img": true},
        ],
    },
    "index_7":{
        "subtitle": "Сопоставьте по схеме элементы конструкции и их названия.",
        "step_of_popup": "Сопоставьте по схеме элементы конструкции и их названия.",
        "test": [            
            {"type": 3},
            {"image": true, "image_path": "./content/1111_111_11.png"},
            {"answers": [
                "Вакуумный фильтр",
                "Газгольдер",
                "Вакуумный приемник",
                "Вакуумный компрессор"
            ]}
        ],
    },
    "index_8":{
        "subtitle": "Сопоставьте по схеме номер трубопровода и название транспортируемой среды.",
        "step_of_popup": "Сопоставьте по схеме номер трубопровода и название транспортируемой среды.",
        "test": [            
            {"type": 3},
            {"image": true, "image_path": "./content/eighth_p_img_6_2.png"},
            {"answers": [
                "Суспензия сырья в растворителе",
                "Растворитель",
                "Раствор депарафинизированного масла",
                "Раствор промывной",
                "Раствор гача или петролатума",
                "Инертный газ",
                "Фильтрат горячей отмывки"
            ]}
        ],
    },
    "index_9":{
        "subtitle": "Изучите разновидности процесса депарафинизации экстрактной кристаллизацией.",
        "step_of_popup": "Изучите разновидности процесса депарафинизации экстрактной кристаллизацией.",
        "paragraph_1":[
            {"text": `Процессы, применяемые при производстве нефтяных масел, имеют свои особенности, которые и определяют их применение и использование растворителей.`},
            {"text": `К таким процессам относят:
            <ul>
                <li>процесс «Дилчил»;</li>
                <li>процесс «Эделеану»;</li>
                <li>процесс депарафинизации пропаном.</li>
            </ul>
            `},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/nineth_p_img_6_2.png", "img_sign": " ", "left_img": true},
        ],
    },
    "index_10":{
        "subtitle": "Установите соответствие между разновидностью процесса депарафинизации и его характеристиками.",
        "step_of_popup": "Установите соответствие между разновидностью процесса депарафинизации и его характеристиками.",
        "test": [{
            "type": 7
        }, {
            "anwserArr2": ['Выше скорость охлаждения', 'Небольшая кратность', 'Низкая скорость фильтрования', 'Низкий температурный градиент', 'Нет системы инертного газа', 'Высокий выход депарафинизата', 'Система обезвоживания растворителя']
        }, {
            "answersInCol": [['Выше скорость охлаждения', 'Небольшая кратность', 'Низкая скорость фильтрования'], ['Низкий температурный градиент', 'Нет системы инертного газа'], ['Высокий выход депарафинизата', 'Система обезвоживания растворителя']]
        }, {
            "columns": ['Депарафинизация пропаном', 'Процесс «Эделеану»', 'Процесс «Дилчил»']
        }],
    },
    "index_11":{
        "subtitle": "Результаты",
        "step_of_popup": "Результаты",
        "result":[]
    },
}
window.dataLoaded = true;